Tests/Performance/tests/perf-test.yaml
config:
  http:
    timeout: 10
  ensure:
    maxErrorRate: 1
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 180
      arrivalRate: 50
      name: Sustained load
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/about"
      - get:
          url: "/contact"