Tests/Performance/tests/perf-test.yaml
config:
  http:
    timeout: 10
  ensure:
    maxErrorRate: 1
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/about"
      - get:
          url: "/contact"